
export const TestTitleList = [
    '最新のテクノロジー動向',
    'プログラミング入門ガイド',
    'AIと機械学習の未来',
    'クラウドコンピューティングの基礎',
    'データサイエンスの応用',
    'ウェブ開発のベストプラクティス',
    'サイバーセキュリティの重要性',
    'モバイルアプリ開発のトレンド',
    'ブロックチェーン技術の概要',
    'IoTとスマートデバイスの進化'
]

export const TestTalks = [
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
    {
        name: 'ずんだもん',
        audio: new Uint8Array(0),
        time: 5
    },
]

export const TestData = [
    {
        talker: 'ずんだもん',
        message: 'こんにちは！今日は「Awesome Screen Recorder & Screenshot」というツールについて解説するねこのツールはスクリーン録画やスクリーンショットを撮るのにとても便利なんだよ10年以上の安定したサービスを提供していて300万人以上のユーザーがいるんだ'
    },
    {
        talker: 'ふなっしー',
        message: 'おお！それはすごい梨！どんな機能があるのか気になるなっしー！'
    },
    {
        talker: 'ずんだもん',
        message: 'まずデスクトップや特定のタブカメラのみを録画できるよマイクやウェブカメラも使えるし解像度は720pから4Kまで選べるんだ録画した動画はローカルやオンラインに保存できてJiraやSlackなんかで簡単に共有できるんだよ'
    },
    {
        talker: 'ふなっしー',
        message: '共有も簡単にできるのは便利なっしー！スクリーンショットの機能についても教えてほしい梨！'
    },
    {
        talker: 'ずんだもん',
        message: 'スクリーンショットは訪問しているページの全体や選択した部分ウィンドウ全体を撮れるんださらにスクリーンショットに注釈を付けたりサイズを変更したりテキストを追加したりできるんだあと重要な部分をハイライトすることもできるよ'
    },
    {
        talker: 'ふなっしー',
        message: '注釈を付けられるのはいいなっしー！これならいろんな場面で使えそう梨！プライバシーや広告についてはどうなってるの？'
    },
    {
        talker: 'ずんだもん',
        message: 'プライバシーを尊重して広告もないから安心して使えるよそれにユーザーの声を大事にして改善を続けているんだって何か質問や要望があればフィードバックボタンやメールで連絡できるよ'
    },
    {
        talker: 'ふなっしー',
        message: 'ユーザーの声を大切にしているのはいいことなっしー！これは試してみる価値がある梨！'
    }
]
